from config import DONATE_LINK


NEED_REGISTER_MESSAGE = "Пользователь не зарегистрирован. Чтобы зарегистрироваться используйте команду /register"

CANCEL_REGISTRATION_MESSAGE = "Для выхода из формы регистрации - используйте команду /cancel"

get_greeting = lambda name, emoji: f"<b>Привет, {name} {emoji}</b>\n"
START_MESSAGE = "\
Учишься в <a href='https://www.herzen.spb.ru/'>РГПУ им. А. И. Герцена</a> и устал от неудобного \
<a href='https://guide.herzen.spb.ru/static/schedule.php'>сайта</a> с расписанием?\n\n\
Тогда жми по кнопке, регистрируйся и получай расписание в удобном формате :)\
"

HELP_MESSAGE = f"\
<b>Список команд:</b>\n\
/today - расписание на сегодня.\n\
/tomorrow - расписание на завтра.\n\
/week - полное расписание на неделю.\n\n\
/date - расписание по дате. <i>Также, можно просто отправить любую дату в формате <u>дд.мм.гггг</u> \
и получить по ней расписание.</i>\n\n\
/register - регистрация в боте. <i>Отвечает за сохранение пользователя в базе данных, а также для изменения уже существующих данных.</i>\n\
"

ABOUT_MESSAGE = f"\
<b>Привет, я разработчик данного бота :)</b>\n\
Этот проект не является коммерческим и сделан мной на чистом энтузиазме, \
так что буду рад любой <a href='{DONATE_LINK}'>поддержке!</a> \
\n\nПо поводу любых багов, предложений или вопросов - просьба обращаться по \
<a href='https://t.me/crawlic'>ссылке</a> или по кнопке ниже :)\
"
